notes.org
#+TITLE: Advent of code 2022
#+EXPORT_FILE_NAME: README.md

Doing these excercises in FORTH (gforth in particular) for practice.

Also looking at [[https://gitlab.cs.washington.edu/fidelp/advent-of-code-2022/-/tree/main][this repo]] for examples on how to be more idomatic.

[[https://www.reddit.com/r/Forth/comments/zclwlx/advent_of_code_in_forth/][Reddit Thread]]

My solutions are generally a few times more complicated than the examples, the
v2 versions are all re-dos to try and improve.

* Notes

  - Allow forth to do the parsing where available
    + Make the input work as forth code
  - I was doing a lot of error checking for fixed input
  - I can use a few more variables to help clean up
    + ex: ~fd-not-eof~ in ~1-task-v2.fs~
