README.md

# Table of Contents

1.  [Notes](#org3ba6cf6)

Doing these excercises in FORTH (gforth in particular) for practice.

Also looking at [this repo](https://gitlab.cs.washington.edu/fidelp/advent-of-code-2022/-/tree/main) for examples on how to be more idomatic.

My solutions are generally a few times more complicated than the examples, the
v2 versions are all re-dos to try and improve.


<a id="org3ba6cf6"></a>

# Notes

-   Allow forth to do the parsing where available
    -   Make the input work as forth code
-   I was doing a lot of error checking for fixed input
-   I can use a few more variables to help clean up
    -   ex: `fd-not-eof` in `1-task-v2.fs`

